Repository: stjordanis/pybliographer
Catalog: help/*/*.po
Languages: sv

# _
source: translator-credits
sv: Anders Jonsson <anders.jonsson@norsjovallen.se>, 2021

source: Information about <app>Pybliographer</app>.
sv: Information om <app>Pybliographer</app>.

source: Creative Commons Share Alike 3.0
sv: Creative Commons DelaLika 3.0

source: Authors
sv: Författare

source: <app>Pybliographer</app> was originally written by Frédéric Gobry. Many thanks to all contributors for their fruitful work.
sv: <app>Pybliographer</app> skrevs ursprungligen av Frédéric Gobry. Många tack till alla bidragsgivare för deras givande arbete.

source: <em>Contributions:</em>
sv: <em>Bidrag:</em>

source: Documentation, translations
sv: Dokumentation, översättningar

source: Internationalization, UI goodies
sv: Internationalisering, godbitar i användargränssnittet

source: Project maintainer, core application, Gnome interface, documentation
sv: Projektansvarig, kärnprogrammet, GNOME-gränssnitt, dokumentation

source: Documentation, packaging, ui code
sv: Dokumentation, paketering, användargränssnittskod

source: Original Ovid parser
sv: Ursprunglig Ovid-tolk

source: APA 4th edition style
sv: APA-stil (4:e upplagan)

source: Application design, requirement docs, import and ui code
sv: Programdesign, kravdokumentation, kod för import och användargränssnitt

source: Medline database parser
sv: Tolk för Medline-databasen

source: Thanks to everyone who helped out with the bug tracking process.
sv: Tack till alla som hjälpt till med spårningsprocessen för felrapporter.

source: Many thanks also to the Documentation Translators and the Gnome Translation Teams.
sv: Även många tack till översättarna av dokumentation och GNOME:s översättningsgrupper.

source: This manual was written with the help of the <link href="https://wiki.gnome.org/DocumentationProject">GNOME Documentation Project</link>.
sv: Denna handbok skrevs med hjälp av <link href="https://wiki.gnome.org/DocumentationProject">GNOME:s dokumentationsprojekt</link>.

source: If you contributed to this project but do not see your name here, please contact the project maintainer and he'll list you.
sv: Om du bidragit till detta projekt men inte ser ditt namn här kan du kontakta den projektansvarige så kan han lägga till dig i listan.

source: For more information please visit the <link href="http://pybliographer.org/"><app>Pybliographer</app> website</link>.
sv: Besök <link href="http://pybliographer.org/">webbplatsen för <app>Pybliographer</app></link> för mer information.

source: Where you can get additional help.
sv: Var du kan hitta ytterligare hjälp.

source: Additional Help Sources
sv: Ytterligare hjälpkällor

source: For additional information, please, visit the <link href="http://pybliographer.org/">Pybliographer website</link>. There is a <link href="http://pybliographer.org/Mailing_lists">mailing list</link> also, where you can get answers for your questions, you can report bugs, etc.
sv: Besök <link href="http://pybliographer.org/">webbplatsen för Pybliographer</link> för mer information. Det finns även en <link href="http://pybliographer.org/Mailing_lists">sändlista</link> där du kan hitta svar på dina frågor och rapportera fel med mera.

source: Using <app>Pybliographer</app> with a terminal.
sv: Använda <app>Pybliographer</app> med en terminal.

source: The command line interface
sv: Kommandoradsgränssnittet

source: To start <app>Pybliographer</app> in command line mode, type the following command:
sv: För att starta <app>Pybliographer</app> i kommandoradsläge skriver du in följande kommando:

source: <output>bash$ </output><input>pybliographer</input> This is pybliographer, version 1.2.12 Copyright (C) 1998-2004 Frederic GOBRY This is free software with ABSOLUTELY NO WARRANTY. For details, type `warranty'. Useful commands: help to get some help quit to quit &gt;&gt;
sv: <output>bash$ </output><input>pybliographer</input> Det här är pybliographer, version 1.2.12 Copyright (C) 1998-2004 Frederic GOBRY Detta är fri programvara UTAN NÅGON SOM HELST GARANTI. För mer detaljer, skriv ”warranty”. Användbara kommandon: help för att få hjälp quit för att avsluta &gt;&gt;

source: To get some help about how to use <app>Pybliographer</app> in this mode, type <cmd>help</cmd> at the <app>Pybliographer</app> prompt.
sv: För att få hjälp hur du använder <app>Pybliographer</app> i detta läge, skriv <cmd>help</cmd> i <app>Pybliographer</app>-prompten.

source: The next example shows how to open a database and make a simple search in it. See the following commands and the output:
sv: Nästa exempel visar hur du öppnar en databas och gör en enkel sökning i den. Se följande kommandon och utdata:

source: &gt;&gt; db = bibopen ("database.bib") &gt;&gt; iterator = search (db, 'author = Mantsch') &gt;&gt; ls (iterator) The Use and Misuse of FTIR Spectro Jackson, Michael; Mantsc [JM95 ] Phospholipid phase transitions in Mantsch, H. H.; McElhane [MM01 ] &gt;&gt;
sv: &gt;&gt; db = bibopen ("databas.bib") &gt;&gt; iterator = search (db, 'author = Mantsch') &gt;&gt; ls (iterator) The Use and Misuse of FTIR Spectro Jackson, Michael; Mantsc [JM95 ] Phospholipid phase transitions in Mantsch, H. H.; McElhane [MM01 ] &gt;&gt;

source: To see the complete entries listed by the command <cmd>ls (iterator)</cmd>:
sv: För att se de kompletta posterna som listas av kommandot <cmd>ls (iterator)</cmd>:

source: How to customize this application to match your needs.
sv: Hur du anpassar det här programmet efter dina behov.

source: Advanced Configuration
sv: Avancerad konfiguration

source: The configuration system is heavily based on <app>Python</app>'s module system. The configuration files are standard <app>Pybliographer</app> scripts (that is, python code making use of <app>Pybliographer</app> extra classes and functions), whose single special feature is to be automatically parsed at startup or when needed.
sv: Konfigurationssystemet är starkt baserat på <app>Python</app>s modulsystem. Konfigurationsfilerna är vanliga <app>Pybliographer</app>-skript (det vill säga pythonkod som använder extra klasser och funktioner från <app>Pybliographer</app>), vars enda speciella funktion är att automatiskt tolkas vid uppstart eller vid behov.

source: Files involved
sv: Berörda filer

source: The first file to be parsed is <file>${prefix}/share/pybliographer/pybrc.py </file>. It serves as a bootstrap for the general configuration mechanism, and defines:
sv: Den första filen som tolkas är <file>${prefix}/share/pybliographer/pybrc.py </file>. Den fungerar som startmotor för den allmänna konfigurationsmekanismen och definierar:

source: the available input and output formats
sv: de tillgängliga indata- och utdataformaten

source: where to find the configuration directories.
sv: var konfigurationskatalogerna hittas.

source: A configuration directory holds a list of files which are parsed when needed. For example, if a method requires some configuration data for the bibtex module, it will import the corresponding file in this directory.
sv: En konfigurationskatalog innehåller en lista filer som tolkas när de behövs. Om till exempel en metod behöver konfigurationsdata för bibtex-modulen kommer den importera motsvarande fil i denna katalog.

source: This mechanism allows more flexibility to add new formats: the new format can be installed with a default configuration without messing with the global configuration file. In addition, the program imports only what is needed, decreasing its startup time.
sv: Denna mekanism tillåter mer flexibilitet för att lägga till nya format: det nya formatet kan installeras med en standardkonfiguration utan att behöva böka med den globala konfigurationsfilen. Dessutom importerar programmet bara vad som behövs vilket minskar dess uppstartstid.

source: Finally, if the user provides a file called <file>.pybrc.py</file> in its home directory, this file is then parsed. Of course it can also define a private configuration directory, and override what has been defined before.
sv: Slutligen kommer filen <file>.pybrc.py</file> i användarens hemkatalog tolkas om en sådan fil tillhandahålls. Den kan förstås också definiera en privat konfigurationskatalog och åsidosätta vad som har definierats tidigare.

source: The <sys>Config</sys> module
sv: Modulen <sys>Config</sys>

source: All the data that can be configured should be handled by the so-called <sys>Config</sys> module. It provides a standard interface to set/get and document configuration items.
sv: Alla data som kan konfigureras bör hanteras av den så kallade <sys>Config</sys>-modulen. Den tillhandahåller ett standardgränssnitt för att ställa in/erhålla och dokumentera konfigurationsobjekt.

source: Your first steps in <app>Pybliographer</app>.
sv: Dina första steg i <app>Pybliographer</app>.

source: Getting Started
sv: Komma igång

source: What is <app>Pybliographer</app>?
sv: Vad är <app>Pybliographer</app>?

source: Pybliographer is a tool for working with bibliographic databases. It provides a general framework that can be used to manipulate these databases with a simple graphical interface, but that can also be easily extended by the mean of a scripting language, to fit a wide range of needs.
sv: Pybliographer är ett verktyg för att arbeta med bibliografidatabaser. Det tillhandahåller ett allmänt ramverk som kan användas för att manipulera dessa databaser med ett enkelt grafiskt gränssnitt, men som även lätt kan utökas genom ett skriptspråk för att passa ett brett intervall av behov.

source: How to start <app>Pybliographer</app>?
sv: Hur startar jag <app>Pybliographer</app>?

source: You can start <app>Pybliographer</app> in the following ways:
sv: Du kan starta <app>Pybliographer</app> på följande sätt:

source: Graphical mode
sv: Grafiskt läge

source: To start <app>Pybliographer</app> in graphical mode from a command line, type the following command, then press <key>Return</key>: <cmd>pybliographic</cmd>. For more information on the graphical interface, see <link xref="gui"/>.
sv: För att starta <app>Pybliographer</app> i grafiskt läge från en kommandorad, skriv in följande kommando, och tryck sedan <key>Retur</key>: <cmd>pybliographic</cmd>. För mer information om det grafiska gränssnittet, se <link xref="gui"/>.

source: It is possible to set the PYBLIOGRAPHER_DATABASE environment variable to an admissible bibliography file in order to open it always on startup, if no files are specified on the command line. Example:
sv: Det är möjligt att ställa in miljövariabeln PYBLIOGRAPHER_DATABASE till en godtagbar bibliografifil för att alltid öppna den vid uppstart, om inga filer anges på kommandoraden. Exempel:

source: <output>bash$ </output><input>export PYBLIOGRAPHER_DATABASE=<var>my/database.bib</var></input> <output>bash$ </output><input>pybliographic</input>
sv: <output>bash$ </output><input>export PYBLIOGRAPHER_DATABASE=<var>min/databas.bib</var></input> <output>bash$ </output><input>pybliographic</input>

source: It is equivalent to
sv: Det är ekvivalent med

source: <output>bash$ </output><input>pybliographic <var>my/database.bib</var></input>
sv: <output>bash$ </output><input>pybliographic <var>min/databas.bib</var></input>

source: Command line mode
sv: Kommandoradsläge

source: You can start <app>Pybliographer</app> also in command line mode by typing the following command followed by pressing <key>Return</key>: <cmd>pybliographer</cmd>. For more information, see <link xref="command-line"/>.
sv: Du kan även starta <app>Pybliographer</app> i kommandoradsläge genom att skriva in följande kommando följt av att trycka på <key>Retur</key>: <cmd>pybliographer</cmd>. För mer information, se <link xref="command-line"/>.

source: From the GNOME menu
sv: Från GNOME-menyn

source: If the <file>*.desktop</file> file of the package is correctly installed in your sytem, you can find a launcher under the GNOME menu to start the graphical interface of <app>Pybliographer</app>.
sv: Om <file>*.desktop</file>-filen för paketet är korrekt installerad på ditt system kan du hitta en programstartare under GNOME-menyn för att starta det grafiska gränssnittet för <app>Pybliographer</app>.

source: How to create a new database.
sv: Hur du skapar en ny databas.

source: Creating a new database
sv: Skapa en ny databas

source: When <app>Pybliographic</app> is opened, you can immediately begin to create a new database. The type of this database will be determined when you will save it the first time.
sv: När <app>Pybliographic</app> öppnas kan du omedelbart börja skapa en ny databas. Typen för denna databas kommer att avgöras när du sparar den för första gången.

source: To add a new entry, you can use the <guiseq><gui>Edit</gui> <gui>Add</gui></guiseq> menu, directly the <gui>Add</gui> toolbar button or click with the right button in the list window and select <gui>Add</gui>.
sv: För att lägga till en ny post kan du använda menyn <guiseq><gui>Redigera</gui> <gui>Lägg till</gui></guiseq>, direkt använda verktygsfältsknappen <gui>Lägg till</gui> eller högerklicka i listfönstret och välja <gui>Lägg till</gui>.

source: You will find more information on the main window's usage in <link xref="gui-navigating"/>.
sv: Du hittar mer information om huvudfönstrets användning i <link xref="gui-navigating"/>.

source: Editing entries.
sv: Redigera poster.

source: Editing
sv: Redigering

source: Basic editing
sv: Grundläggande redigering

source: <media type="image" mime="image/png" src="figures/edit.png"> The Edition window </media>
sv: <media type="image" mime="image/png" src="figures/edit.png"> Redigeringsfönstret </media>

source: The edition window is represented in the figure above. On the right of each field, a symbol indicates if <app>Pybliographer</app> has been able to render all the information given in that field. For example, a BibTeX field containing an unknown command name cannot be correctly represented. In that case, <app>Pybliographer</app> provides a fake representation, and indicates it was not able to do a good job on this field by setting a red symbol on its right, instead of a green one.
sv: Redigeringsfönstret representeras i figuren ovan. Till höger om varje fält indikerar en symbol om <app>Pybliographer</app> har kunnat rendera all information som givits i det fältet. Exempelvis kan ett BibTeX-fält som innehåller ett okänt kommandonamn inte representeras korrekt. I det fallet tillhandahåller <app>Pybliographer</app> en fuskrepresentation och indikerar att det inte kunde göra ett bra jobb på detta fält genom att sätta en röd symbol till höger om det istället för en grön.

source: If you edit such an entry, you can loose the additional information it contained. To avoid this, consider using native editing (see <link xref="gui-edit#gui-edit-native"/>).
sv: Om du redigerar en sådan post kan du förlora den ytterligare information som den innehöll. Överväg att använda ursprungsredigering för att undvika detta (se <link xref="gui-edit#gui-edit-native"/>).

source: To edit the entries, simply type the corresponding text, without any consideration for the database format being used. For example, with <app>BibTeX</app>, don't add any <em>{</em> or special characters to influence the result, as they will be quoted by the system. For fields requiring names (like author and editor), use the following format: type one name per line, in the <em>last name, lineage, first name</em> order. If an author or editor field has too many names, you can end the list of names with <em>others</em>; the standard bibtex styles convert this to <em>et al</em>.
sv: För att redigera posterna, skriv helt enkelt motsvarande text, utan hänsyn till databasformatet som används. Lägg till exempel med <app>BibTeX</app> inte till några <em>{</em> eller specialtecken för att påverka resultatet, då de kommer citeras av systemet. För fält som kräver namn (som författare och redaktör) används följande format: skriv ett namn per rad, i ordningen <em>efternamn, släktnamn, förnamn</em>. Om ett författar- eller redaktörsfält har för många namn kan du avsluta listan med <em>others</em>; standardbibtexstilarna konverterar detta till <em>et al</em>.

source: In addition to the standard fields, you can create your own fields using the <gui>Create Field</gui> button.
sv: Utöver standardfälten kan du skapa dina egna fält genom att använda knappen <gui>Skapa fält</gui>.

source: You can customize the mandatory and optional fields for the different type of entries. For example, associating the <em>URL</em> field with a given type of entry, it is possible to assign an url to an entry (e.g. the location of the pdf version of an article or the address of a website). See the window below. More information about the association of fields can be found in <link xref="gui-settings"/>.
sv: Du kan anpassa de obligatoriska och valfria fälten för de olika posttyperna. Att exempelvis associera <em>URL</em>-fältet med en viss posttyp gör det möjligt att tilldela en url till en post (t.ex. platsen för pdf-versionen för en artikel eller adressen för en webbplats). Se fönstret nedan. Mer information om associering av fält kan hittas i <link xref="gui-settings"/>.

source: <media type="image" mime="image/png" src="figures/edit2.png"> The Edition window - Optional fields </media>
sv: <media type="image" mime="image/png" src="figures/edit2.png"> Redigeringsfönstret - Valfria fält </media>

source: The following keyboard shortcuts are available during edition (in addition to the standard ones provided by Gtk):
sv: Följande tangentbordsgenvägar finns tillgängliga under redigering (utöver de standardgenvägar som tillhandahålls av Gtk):

source: <keyseq><key>Ctrl</key><key>TAB</key></keyseq> to jump to the next field
sv: <keyseq><key>Ctrl</key><key>TABB</key></keyseq> för att hoppa till nästa fält

source: <keyseq><key>Shift</key><key>TAB</key></keyseq> to jump to the previous field
sv: <keyseq><key>Skift</key><key>TABB</key></keyseq> för att hoppa till föregående fält

source: <keyseq><key>Ctrl</key><key>Enter</key></keyseq> to accept the modifications
sv: <keyseq><key>Ctrl</key><key>Retur</key></keyseq> för att acceptera ändringarna

source: <key>Esc</key> to cancel the edition
sv: <key>Esc</key> för att avbryta redigeringen

source: To specify a crossreference to another entry, just drag the entry from the main list to the <gui>Crossreference</gui> field. To remove a crossreference, drag an empty selection on the field. To unselect all the entries, you might need to use the <key>Control</key> key, while clicking on the entry.
sv: För att ange en korsreferens till en annan post kan du helt enkelt dra posten från huvudlistan till fältet <gui>Korsreferens</gui>. För att ta bort en korsreferens, dra en tom markering till fältet. För att avmarkera alla poster kan du behöva använda tangenten <key>Ctrl</key> samtidigt som du klickar på posten.

source: Native editing
sv: Ursprungsredigering

source: For databases like BibTeX that provide a specific syntax (called <em>native</em> syntax), it is possible to directly edit the entry in this format. Just click the button called <gui>Native Editing</gui> at the bottom of the window and type the entry in its native form.
sv: För databaser som BibTeX vilka tillhandahåller en specifik syntax (kallad <em>ursprungs</em>syntax) är det möjligt att direkt redigera posten i detta format. Klicka bara på knappen <gui>Ursprungsredigering</gui> längst ner i fönstret och mata in posten i dess ursprungsform.

source: It is also possible to type native commands in the normal editing window. For example, if you want to use special LaTeX commands like <cmd>\textbf</cmd> in a title, you can type them directly in the <gui>Title</gui> field by preceding the text with a <em>@</em> symbol (as the first character). After that symbol, you have to use all the BibTeX conventions (braces, backslashes,...), as none of them will be escaped or modified by <app>Pybliographer</app>.
sv: Det är också möjligt att skriva in ursprungskommandon i det normala redigeringsfönstret. Om du till exempel vill använda speciella LaTeX-kommandon som <cmd>\textbf</cmd> i en titel kan du skriva in dem direkt i fältet <gui>Titel</gui> genom att föregå texten med en <em>@</em>-symbol (som första tecken). Efter den symbolen måste du använda alla BibTeX-konventioner (hakparenteser, bakåtstreck,…), då ingen av dem kommer att förses med kontrollsekvens eller ändras av <app>Pybliographer</app>.

source: Other file formats which you can also use.
sv: Andra filformat som du också kan använda.

source: Saving selected entries in different formats
sv: Spara valda poster i olika format

source: Selected entries can be saved in different formats using the <guiseq><gui>Cite</gui><gui>Format...</gui></guiseq> menu item, see the following window:
sv: Valda poster kan sparas i olika format med menyobjektet <guiseq><gui>Citera</gui><gui>Formatera…</gui></guiseq>, se följande fönster:

source: <media type="image" mime="image/png" src="figures/format.png"> Formatting entries </media>
sv: <media type="image" mime="image/png" src="figures/format.png"> Formatera poster </media>

source: As a result, a formatted output file is generated according to a bibliographic style, either in HTML, LaTeX, Raw or Text format. The <app>Pybliographer</app> package contains some bibliographic styles, but own styles can also be created easily. See also <link xref="scripting-existing#script-scripting-existing-pybformat"/>.
sv: Som ett resultat skapas en formaterad utdatafil enligt en bibliografistil, i något av formaten HTML, LaTeX, Raw eller Text. Paketet <app>Pybliographer</app> innehåller några bibliografistilar, men egna stilar kan också lätt skapas. Se även <link xref="scripting-existing#script-scripting-existing-pybformat"/>.

source: Explanations about the navigation in the database.
sv: Förklaringar om navigering i databasen.

source: Navigating in the entries
sv: Navigera bland posterna

source: Once you have opened a database, or started to create a new one, the main window (see the picture below) displays a list of all the entries on the top part of it. The fields displayed here can be configured under the <guiseq><gui>Settings</gui><gui>Preferences</gui></guiseq> menu item.
sv: När du har öppnat en databas, eller börjat skapa en ny, visar huvudfönstret (se bilden nedan) en lista över alla poster i sin övre del. Fälten som visas här kan konfigureras under menyobjektet <guiseq><gui>Inställningar</gui><gui>Inställningar</gui></guiseq>.

source: It is possible to display two types of combined fields: <em>-author/editor</em> and <em>-author/title-</em>.
sv: Det är möjligt att visa två sorters kombinerade fält: <em>-author/editor-</em> (författare/redaktör) och <em>-author/title-</em> (författare/titel).

source: Clicking on an entry displays its full content on the lower part of the window. It is also possible to use the arrow keys to navigate in the upper list.
sv: Att klicka på en post visar dess fullständiga innehåll i fönstrets nedre del. Det är också möjligt att använda piltangenterna för att navigera i den övre listan.
