Repository: stjordanis/pybliographer
Catalog: help/*/*.po
Languages: sv

source: This tag's content evaluates to nothing when no text has been issued so far. It is a convenient way to add a delimiter after a series of fields without being worried of the special case when the fields are not defined.
sv: Denna taggs innehåll evalueras till inget när ingen text har skrivits in så här långt. Det är ett bekvämt sätt att lägga till en avgränsare efter en serie fält utan att behöva oroa sig för specialfallet när fälten inte är definierade.

source: The existing style files are a good source of examples.
sv: De befintliga stilfilerna är en god källa för exempel.

source: Future of the format
sv: Framtid för formatet

source: In the future, this rudimentary format will most likely be replaced with an XSL-based mechanism, which should encompass both the XML definition and the python modules, thus providing standalone style files, parsable by any XSL parser.
sv: I framtiden kommer detta rudimentära format mest troligt ersättas med en XSL-baserad mekanism, vilken skulle innehålla både XML-definitionen och pythonmodulerna, och därmed tillhandahålla fristående stilfiler, tolkningsbara av alla XSL-tolkar.

source: Interaction with the <app>LyX</app> document processor.
sv: Interaktion med dokumentbehandlaren <app>LyX</app>.

source: Using <app>Pybliographic</app> with <app>LyX</app>
sv: Använda <app>Pybliographic</app> med <app>LyX</app>

source: It is possible to directly use <app>Pybliographer</app> in order to insert bibliographic references into <app>LyX</app>. It is done through the <app>LyX</app> <em>server</em>. The path of the <app>LyX</app> server pipe can be defined in the <guiseq><gui>Tools</gui> <gui>Preferences</gui></guiseq> dialog of LyX. The same path should be given in <app>Pybliographer</app>'s settings (the default value is <file>~/.lyx/lyxpipe)</file>.
sv: Det är möjligt att direkt använda <app>Pybliographer</app> för att infoga bibliografirefenser i <app>LyX</app>. Det görs genom <app>LyX</app>-<em>servern</em>. Sökvägen för <app>LyX</app>-serverröret kan definieras i dialogrutan <guiseq><gui>Verktyg</gui> <gui>Inställningar</gui></guiseq> i LyX. Samma sökväg ska anges i <app>Pybliographer</app>s inställningar (standardvärdet är <file>~/.lyx/lyxpipe)</file>.

source: Then, in <app>Pybliographic</app>, it is possible to select one or several entries and insert their references into a running <app>LyX</app> simply by clicking the <gui>Cite</gui> toolbar button, or selecting the <guiseq><gui>Cite</gui><gui>Cite...</gui></guiseq> menu item.
sv: Sedan är det i <app>Pybliographic</app> möjligt att välja en eller flera poster och infoga deras referenser i ett körande <app>LyX</app> genom att helt enkelt klicka på verktygsfältsknappen <gui>Citera</gui>, eller välja menyobjektet <guiseq><gui>Citera</gui><gui>Citera…</gui></guiseq>.

source: For the moment, it is the user's job to ensure that he/she inserts entries corresponding to the actual database being used. <app>Pybliographic</app> does not handle the full job of bibliography generation; therefore it is necessary to use <cmd>bibtex</cmd> as described in the <app>LyX</app> documentation.
sv: För tillfället är det användarens jobb att säkerställa att hen infogar poster enligt den faktiska databasen som används. <app>Pybliographic</app> hanterar inte det fullständiga jobbet med bibliografiskapande. Därför är det nödvändigt att använda <cmd>bibtex</cmd> så som beskrivs i dokumentationen för <app>LyX</app>.

source: <app>Pybliographic</app> can interact with <app>Kile</app> (&gt;= 1.6) practically in the same way, since <app>Kile</app> can also read <em>lyx pipe</em>.
sv: <app>Pybliographic</app> kan interagera med <app>Kile</app> (&gt;= 1.6) på praktiskt taget samma sätt, då <app>Kile</app> också kan läsa <em>lyx-rör</em>.

# link
source: Pybliographer manual
sv: Handbok för Pybliographer

# text
source: Pybliographer Bibliography manager
sv: Bibliografihanteraren Pybliographer

source: <media type="image" mime="image/png" src="figures/logo.png">Pybliographer logo</media> Pybliographer Bibliography manager
sv: <media type="image" mime="image/png" src="figures/logo.png">Logotyp för Pybliographer</media> Bibliografihanteraren Pybliographer

source: Preface
sv: Inledning

source: Usage
sv: Användning

source: Advanced Usage
sv: Avancerad användning

source: The Scripting Language
sv: Skriptspråket

source: Legal information.
sv: Juridisk information.

source: License
sv: Licens

source: This work is distributed under a CreativeCommons Attribution-Share Alike 3.0 Unported license.
sv: Detta verk distribueras under licensen CreativeCommons Erkännande-DelaLika 3.0 Unported.

source: You are free:
sv: Du har rätt:

source: <em>To share</em>
sv: <em>Att dela</em>

source: To copy, distribute and transmit the work.
sv: Att kopiera, distribuera och överföra verket.

source: <em>To remix</em>
sv: <em>Att remixa</em>

source: To adapt the work.
sv: Att anpassa verket.

source: Under the following conditions:
sv: På följande villkor:

source: <em>Attribution</em>
sv: <em>Erkännande</em>

source: You must attribute the work in the manner specified by the author or licensor (but not in any way that suggests that they endorse you or your use of the work).
sv: Du måste ge erkännande åt verket på det sätt som anges av författaren eller licensgivaren (men inte på ett sätt som antyder att de godkänt eller rekommenderar din användning av verket).

source: <em>Share Alike</em>
sv: <em>Dela lika</em>

source: If you alter, transform, or build upon this work, you may distribute the resulting work only under the same, similar or a compatible license.
sv: Om du ändrar, bearbetar eller bygger vidare på verket, får du distribuera resultatet endast under samma, liknande, eller en kompatibel licens.

source: For the full text of the license, see the <link href="http://creativecommons.org/licenses/by-sa/3.0/legalcode">CreativeCommons website</link>, or read the full <link href="http://creativecommons.org/licenses/by-sa/3.0/">Commons Deed</link>.
sv: För den fullständiga texten för licensen, se vidare <link href="http://creativecommons.org/licenses/by-sa/3.0/legalcode">CreativeCommons webbplats</link>, eller läs det fullständiga <link href="http://creativecommons.org/licenses/by-sa/3.0/">Commons Deed</link>.

source: Basic information about scripting with <app>Pybliographer</app>.
sv: Grundläggande information om att köra skript med <app>Pybliographer</app>.

source: Basics
sv: Grunder

source: <app>Pybliographer</app> is in fact a simple set of classes and functions written in python, and that provides with a simple and homogenous access to bibliographic databases. Therefore, it is possible to write python scripts that make use of these specialized functions. The graphical interface, <app>Pybliographic</app>, is itself a simple script on top of <app>Pybliographer</app>.
sv: <app>Pybliographer</app> är faktiskt en enkel uppsättning klasser och funktioner skrivna i python, som tillhandahåller enkel och homogen åtkomst till bibliografidatabaser. Det är därför möjligt att skriva pythonskript som använder dessa specialiserade funktioner. Det grafiska gränssnittet självt, <app>Pybliographic</app>, är ett enkelt skript ovanpå <app>Pybliographer</app>.

source: To execute a script written for <app>Pybliographer</app>, simply run
sv: För att exekvera ett skript som skrivits för <app>Pybliographer</app>, kör helt enkelt

source: <output>bash$ </output><cmd>pybliographer [--quiet] </cmd><var>myscript.py</var>
sv: <output>bash$ </output><cmd>pybliographer [--quiet] </cmd><var>mittskript.py</var>

source: You can alternatively start your script by
sv: Alternativt kan du starta ditt skript genom

source: #!/path/to/pybliographer <var>...rest of your script...</var>
sv: #!/path/to/pybliographer <var>…resten av ditt skript…</var>

source: and make it executable.
sv: och göra det körbart.

source: How to use the scripts shipped with <app>Pybliographer</app>.
sv: Hur du använder skripten som kommer med <app>Pybliographer</app>.

source: Existing scripts
sv: Befintliga skript

source: Some scripts are provided with <app>Pybliographer</app>, both as example and as useful tools. They are quite short and should be readable with basical knowledge of <app>Python</app>.
sv: Några skript tillhandahålls med <app>Pybliographer</app>, både som exempel och som användbara verktyg. De är ganska korta och bör vara läsbara med grundläggande kunskap i <app>Python</app>.

source: This tool takes a list of files or directory, and check if they are valid (syntax, no entries with the same key,...)
sv: Detta verktyg tar en lista över filer eller kataloger, och kontrollerar om de är giltiga (syntax, inga poster med samma nyckel,…)

source: It is possible to use its output directly in an emacs compile buffer, in order to jump directly to the encountered errors. To do so, type <keyseq><key>M</key><key>x</key></keyseq> <cmd>compile</cmd>, then the command <cmd>pybliocheck <var>yourfiles</var></cmd>, and use the middle button of the mouse to jump into the faulty file.
sv: Det är möjligt att använda dess utdata direkt i en emacs-kompileringsbuffert för att hoppa direkt till de påträffade felen. För att göra detta skriver du <keyseq><key>M</key><key>x</key></keyseq> <cmd>compile</cmd>, och sedan kommandot <cmd>pybliocheck <var>dinafiler</var></cmd>, och använder musens mittenknapp för att hoppa in i den felande filen.

source: This tool extracts the citations made in a LaTeX document and generates a BibTeX file containing them.
sv: Detta verktyg extraherar citeringarna som gjorts i ett LaTeX-dokument och skapar en BibTeX-fil som innehåller dem.

source: Usually, one stores its bibliographies in one or several large BibTeX files, and lets <cmd>bibtex</cmd> extract the entries used in a LaTeX document. But it is sometime convenient to create a self-contained package (for example to share it in native form with somebody else, or to store it), with a minimalistic BibTeX file holding exactly the entries used in LaTeX. This tool does exactly that: it reads a LaTeX <file>.aux</file> file, and extract from the specified BibTeX databases the corresponding entries.
sv: Vanligen lagrar man dess bibliografier i en eller flera stora BibTeX-filer, och låter <cmd>bibtex</cmd> extrahera posterna som används i ett LaTeX-dokument. Men ibland är det praktiskt att skapa ett självständigt paket (exempelvis för att dela det i ursprungsform med någon annan, eller för att lagra det), med en minimalistisk BibteX-fil som innehåller exakt de poster som används i LaTeX. Detta verktyg gör exakt detta: det läser en LaTeX <file>.aux</file>-fil och extraherar de motsvarande posterna från de angivna BibTeX-databaserna.

source: This tool converts from one bibliographic format to another.
sv: Detta verktyg konverterar från ett bibliografiformat till ett annat.

source: The general syntax is pretty simple. To convert from Refer to BibTeX for example, just run:
sv: Den allmänna syntaxen är rätt lätt. För att exempelvis konvertera från Refer till BibTeX kör du bara:

source: This script generates a bibliography according to a bibliographic style, and outputs it in a specific format (like HTML, LaTeX,...) as it should appear in a document.
sv: Detta skript skapar en bibliografi enligt en bibliografistil och matar ut den i ett specifikt format (som HTML, LaTeX,…) som den ska visas i ett dokument.

source: The general form of the command is
sv: Det allmänna formatet för kommandot är

source: <output>bash$ </output><cmd>pyblioformat</cmd> <var>[options] database...</var>
sv: <output>bash$ </output><cmd>pyblioformat</cmd> <var>[flaggor] databas…</var>

source: This command without options will use the style called <em>alpha</em> to create a bibliography in <em>Text</em> format. Several options are available to create these documents:
sv: Detta kommando utan flaggor kommer använda stilen <em>alpha</em> för att skapa en bibliografi i formatet <em>Text</em>. Flera alternativ finns tillgängliga för att skapa dessa dokument:

source: <cmd>--style=...</cmd> or <cmd>-s ...</cmd>: specify a bibliography style. This can be a full path to an existing XML file, or a name which will be searched in the standard places. Default is Alpha.
sv: <cmd>--style=…</cmd> eller <cmd>-s …</cmd>: ange en bibliografistil. Detta kan vara en fullständig sökväg till en befintlig XML-fil, eller ett namn som kommer att sökas på standardplatserna. Standard är Alpha.

source: <cmd>--format=...</cmd> or <cmd>-f ...</cmd>: specify an output format (HTML, LaTeX, Raw, Text, Textau, Textnum). Default is Text. (Textau and Textnum are just slightly modified versions of Text. See <link xref="#script-scripting-existing-pybtext"/> for more details.)
sv: <cmd>--format=…</cmd> eller <cmd>-f …</cmd>: ange ett utdataformat (HTML, LaTeX, Raw, Text, Textau, Textnum). Standard är Text. (Textau och Textnum är smått ändrade versioner av Text. Se <link xref="#script-scripting-existing-pybtext"/> för mer detaljer.)

source: <cmd>--output=...</cmd> or <cmd>-o ...</cmd>: specify an output filename. STDOUT is the default.
sv: <cmd>--output=…</cmd> eller <cmd>-o …</cmd>: ange ett utdatafilnamn. Standardvärdet är STDOUT.

source: <cmd>--header=...</cmd> or <cmd>-H ...</cmd>: defines a file that will be prepended to the output file.
sv: <cmd>--header=…</cmd> eller <cmd>-H …</cmd>: definierar en fil som kommer att läggas till i början på utdatafilen.

source: <cmd>--footer=...</cmd> or <cmd>-F ...</cmd>: defines a file that will be appended to the output file.
sv: <cmd>--footer=…</cmd> eller <cmd>-F …</cmd>: definierar en fil som kommer att läggas till i slutet på utdatafilen.

source: <cmd>--list=output</cmd> or <cmd>-l output</cmd>: lists the available output formats
sv: <cmd>--list=output</cmd> eller <cmd>-l output</cmd>: listar tillgängliga utdataformat

source: This tool searches for the citations in a LaTeX document and generates a LaTeX bibliography file.
sv: Detta verktyg söker efter citeringarna i ett LaTeX-dokument och skapar en LaTeX-bibliografifil.

source: This tool reads a LaTeX <file>.aux</file> file, and extracting the corresponding entries from the specified BibTeX databases creates a LaTeX <file>.bbl</file> file.
sv: Detta verktyg läser en LaTeX <file>.aux</file>-fil, och att extrahera de motsvarande posterna från de angivna BibTeX-databaserna skapar en LaTeX <file>.bbl</file>-fil.

source: The form of the command is
sv: Formatet för kommandot är

source: <output>bash$ </output><cmd>pybliotex</cmd> <file>latexfile</file> [<file>bibtexfiles</file>...]
sv: <output>bash$ </output><cmd>pybliotex</cmd> <file>latexfil</file> [<file>bibtexfiler</file>…]

source: This tool processes a text file containing citations and appends a bibliography according to a given style.
sv: Detta verktyg bearbetar en textfil som innehåller citeringar och lägger till en bibliografi enligt en angiven stil.

source: The script searches for citations like [key] or [key1,key2...] in a text file (for example: ...This is a text fragment with citations [AKM95,MPJ+03] inserted from pybliographer...). First, according to the keys found in the text file, it generates a reference list. Using an appropriate style (see below), it replaces the database keys in the text body with the new keys generated by the style module, and finally it appends the reference list to the text resulting a new file.
sv: Skriptet söker citeringar som [nyckel] eller [nyckel1,nyckel2…] i en textfil (till exempel: …Detta är ett textfragment med citeringar [AKM95,MPJ+03] infogade från pybliographer…). Först skapar det en referenslista i enlighet med nycklarna som hittas i textfilen. Det ersätter databasnycklarna i texten enligt en lämplig stil (se nedan) med de nya nycklarna som skapas av stilmodulen, och lägger slutligen till referenslistan till texten vilket resulterar i en ny fil.

source: The keys of selected entries can be copied easily from pybliographer into a text editor or terminal by <em>copy and paste </em> or <em>drag and drop</em>.
sv: Nycklarna för valda poster kan lätt kopieras från pybliographer till en textredigerare eller terminal genom att använda <em>kopiera och klistra in</em> eller <em>dra och släpp</em>.

source: <output>bash$ </output><cmd>pybliotext</cmd> [-o outputfile] [-s style] <file>textfile</file> <file>bibfiles...</file>
sv: <output>bash$ </output><cmd>pybliotext</cmd> [-o utdatafil] [-s stil] <file>textfil</file> <file>bibfiler…</file>

source: This command without the options will use the style called <em>Abbrev</em> and <file>textfile.pyb</file> as outputfile for processing. <file>textfile</file> is the name of the file to be processed and <file>bibfiles</file> is one or more bibliographic database file.
sv: Detta kommando utan flaggorna kommer använda stilen som kallas <em>Abbrev</em> och <file>textfil.pyb</file> som utdatafil för bearbetning. <file>textfil</file> är namnet på filen som ska bearbetas och <file>bibfiler</file> är en eller flera bibliografidatabasfiler.

source: There are three different <em>styles</em> which are designed for pybliotext. Using <em>abbrvbib</em> results in keys as they are defined in the database. With the style <em>abbrvau</em>, author-year type keys (e.g. Jackson et al., 2004) can be generated. Using <em>abbrvnum</em>, the script produces a simple numbered list. For abbrvau and abbrvnum, the formats Textau and Textnum are used, respectively. They are just simple modifications of the Text format, optimized for these styles. Using other styles (Alpha, Abbrev or apa4e), the text body is not processed, but the reference list is appended in the form that corresponds to the used style.
sv: Det finns tre olika <em>stilar</em> som är designade för pybliotext. Att använda <em>abbrvbib</em> resulterar i nycklar så som de definieras i databasen. Med stilen <em>abbrvau</em> kan nycklar på formen författare-år skapas (t.ex. Jackson et al., 2004). Då <em>abbrvnum</em> används producerar skriptet en enkel numrerad lista. För For abbrvau och abbrvnum används formaten Textau respektive Textnum. De är bara enkla ändringar till formatet Text, optimerat för dessa stilar. Vid användning av andra stilar (Alpha, Abbrev eller apa4e) så bearbetas inte texten, men referenslistan läggs till på formen som motsvarar den använda stilen.

source: Writing your own scripts.
sv: Skriva dina egna skript.

source: Writing your own scripts
sv: Skriva dina egna skript

source: To start writing your own script, you can read what follows, and then have a look at the existing scripts. Trying to adapt them to fit your personal needs can be a good way of testing what you read.
sv: För att börja skriva ditt eget skript kan du läsa det följande och sedan ta en titt på de befintliga skripten. Att försöka anpassa dem för att passa dina personliga behov kan vara ett bra sätt att testa vad du läser.

source: Some concepts
sv: Några koncept

source: This section describes some basic classes and ideas that are useful to understand how <app>Pybliographer</app> works.
sv: Detta avsnitt beskriver vissa grundläggande klasser och idéer som är användbara för att förstå hur <app>Pybliographer</app> fungerar.

source: In the following, all the modules that will be refered to belong to the <em>Pyblio</em> domain. So, to access the members of the <em>Open</em> module, you'll have to write at the beginning of your script something like
sv: I det följande hör alla moduler som refereras till domänen <em>Pyblio</em>. Så för att komma åt medlemmarna i modulen <em>Open</em> kommer du i början av ditt skript behöva skriva något i stil med

source: The <em>Base</em> module contains some of the most basical classes used in the application:
sv: Modulen <em>Base</em> innehåller några av de mest grundläggande klasserna som används i programmet:

source: <em>Base.Entry</em> represents a specific bibliographic entry, with all its fields. It behaves like a hash table which returns the content of a field given its name
sv: <em>Base.Entry</em> representerar en specifik bibliografipost med alla dess fält. Det beter sig som en hashtabell som returnerar innehållet i ett fält givet dess namn

source: <em>Base.DataBase</em> is the class from which every database type inherits. It behaves like a hash table that returns a Base.Entry given a Base.Key
sv: <em>Base.DataBase</em> är klassen från vilken varje databastyp ärver. Det beter sig som en hashtabell som returnerar en Base.Entry givet en Base.Key

source: <em>Key.Key</em> is the object that uniquely identifies an entry. This object must be unique over the whole application, and is composed of a database part and an entry part.
sv: <em>Key.Key</em> är objektet som unikt identifierar en post. Detta objekt måste vara unikt över hela programmet, och består av en databasdel och en postdel.

source: An <em>Iterator</em> is an object that provides a way to access a sequence of items in order. These iterators are used extensively in <app>Pybliographer</app>, because they hide the underlying access mechanism, and provide the same access on any database. They are also perfectly suited for implementing transparent filtering and sorting of entries: the <em>Selection.Selection</em> class for example takes an iterator (on a database for example) and return a new one which will only iterate on a subset of the entries, according to a search criterion.
sv: En <em>Iterator</em> är ett objekt som tillhandahåller ett sätt att komma åt en sekvens objekt i ordning. Dessa iteratorer används omfattande i <app>Pybliographer</app>, för de döljer den underliggande åtkomstmekanismen, och tillhandahåller samma åtkomst för alla databaser. De är också perfekt lämpade för att implementera transparent filtrering och sortering av poster: klassen <em>Selection.Selection</em> tar exempelvis en iterator (t.ex. på en databas) och returnerar en ny som bara kommer iterera på en delmängd av posterna enligt ett sökkriterium.

source: Typographical conventions used in this documentation.
sv: Typografiska konventioner som används i denna dokumentation.

source: Typographical Conventions
sv: Typografiska konventioner

source: In this book, we'll mark some words with special typography:
sv: I denna bok kommer vi markera några ord med speciell typografi:

source: <app>Applications</app>
sv: <app>Program</app>

source: <cmd>Commands</cmd> you type at the command line
sv: <cmd>Kommandon</cmd> som du skriver på kommandoraden

source: <file>Filenames</file>
sv: <file>Filnamn</file>

source: <var>Replaceable text</var>
sv: <var>Utbytbar text</var>

source: <gui>Labels</gui> for buttons and other portions of the graphical interface
sv: <gui>Etiketter</gui> för knappar och andra delar av det grafiska gränssnittet

source: Menu selections look like this: <guiseq><gui>Menu</gui> <gui>Submenu</gui><gui>Menu Item</gui></guiseq>
sv: Menyval ser ut så här: <guiseq><gui>Meny</gui> <gui>Undermeny</gui><gui>Menyobjekt</gui></guiseq>

source: <gui>Buttons</gui> you can click
sv: <gui>Knappar</gui> som du kan klicka på

source: <input>Anything you type in</input>
sv: <input>Allt som du skriver in</input>

source: We'll provide assorted bits of additional information in tips and notes as well.
sv: Vi kommer även tillhandahålla utvald ytterligare information i tips och anteckningar.

source: Tip
sv: Tips

source: Tips and bits of extra information will look like this.
sv: Tips och extra informationsstycken kommer se ut så här.

source: Note
sv: Anteckning

source: Notes will look like this.
sv: Anteckningar kommer se ut så här.

source: We'll have warnings, in cases where you should be careful:
sv: Vi kommer att ha varningar i fall där du ska vara försiktig:

source: Example Warning
sv: Exempelvarning

source: This is what a warning looks like. If there's a chance you'll run into trouble, we'll warn you beforehand.
sv: Så här ser en varning ut. Vi kommer varna dig i förväg om det finns en risk att du stöter på problem.
