Repository: stjordanis/pybliographer
Catalog: help/*/*.po
Languages: sv

source: New features in <app>Pybliographer</app> 1.2.18.
sv: Nya funktioner i <app>Pybliographer</app> 1.2.18.

source: What's New in Pybliographer 1.2.18
sv: Vad är nytt i Pybliographer 1.2.18

source: You can find a list of bugs fixed and features added in the <file>NEWS</file> and <file>ChangeLog</file> files supplied with the package. See the source tarball of pybliographer, or the default doc directory of your distribution (e.g. <file>/usr/share/doc/pybliographer</file>).
sv: Du kan hitta en lista över fixade fel och tillagda funktioner i filerna <file>NEWS</file> och <file>ChangeLog</file> som kommer med paketet. Se källtarbollen för pybliographer, eller standardkatalogen för dokumentation för din distribution (t.ex. <file>/usr/share/doc/pybliographer</file>).
