Repository: stjordanis/pybliographer
Catalog: help/*/*.po
Languages: sv

source: If an entry contains an <em>URL</em> field, clicking on the small button next to the url, the appropriate application is launched to view the target object (e.g. PDF viewer for pdf files, web browser for http address). See <link xref="gui-edit"/> about how to add an URL field to an entry. Alternatively, you can open the URL with the help of the <guiseq><gui>View</gui><gui>Resource</gui></guiseq> submenu item or the <guiseq><gui>Resource</gui></guiseq> pop up menu provided for the item list. If an item contains one or more viewable fields (like url) containing viewable resources, it is marked with an icon at the left edge of the item in the upper part of the main window (see the picture below).
sv: Om en post innehåller ett <em>URL</em>-fält kommer att klicka på den lilla knappen intill URL:en att starta det lämpliga programmet för att visa målobjektet (t.ex. en PDF-visare för PDF-filer, webbläsare för en http-adress). Se <link xref="gui-edit"/> för hur du kan lägga till ett URL-fält till en post. Alternativt kan du öppna URL:en med hjälp av undermenyobjektet <guiseq><gui>Visa</gui><gui>Resurs</gui></guiseq> eller poppuppmenyn <guiseq><gui>Resurs</gui></guiseq> som tillhandahålls för objektlistan. Om ett objekt innehåller ett eller flera visningsbara fält (som URL) som innehåller visningsbara resurser, så markeras det med en ikon på vänster kant av objektet i huvudfönstrets övre del (se bilden nedan).

source: You can set the viewable fields and the applications used to view the resources in the <gui>Resource</gui> tab under the <guiseq><gui>Settings</gui><gui>Preferences</gui></guiseq> menu.
sv: Du kan ställa in de visningsbara fälten och programmen som används för att visa resurserna i fliken <gui>Resurs</gui> under menyn <guiseq><gui>Inställningar</gui><gui>Inställningar</gui></guiseq>.

source: Clicking on an entry while pressing the <key>Shift</key> key extends the selection to the clicked entry. A click while pressing the <key>Control</key> key toggles the entry without altering the state of the rest of the selection. With copy and paste, or by drag and drop you can copy one or more selected entries into a new window or database.
sv: Att klicka på en post under tiden som tangenten <key>Skift</key> hålls ned utökar markeringen till den klickade posten. Ett klick under tiden tangenten <key>Ctrl</key> hålls ned ändrar markeringstillståndet för posten utan att ändra tillståndet för resten av markeringen. Med kopiera och klistra in, eller genom att dra och släppa, kan du kopiera en eller flera markerade poster till ett nytt fönster eller en ny databas.

source: <media type="image" mime="image/png" src="figures/main.png"> The main window </media>
sv: <media type="image" mime="image/png" src="figures/main.png"> Huvudfönstret </media>

source: Clicking the right button of the mouse in the list opens a contextual menu. With this menu you can:
sv: Att högerklicka på musen i listan öppnar en snabbvalsmeny. Med denna meny kan du:

source: add a new entry
sv: lägga till en ny post

source: edit the currently selected items
sv: redigera de för närvarande markerade objekten

source: view the resource associated with the selected item
sv: visa resursen som är associerad med det markerade objektet

source: delete the currently selected items
sv: ta bort de för närvarande markerade objekten

source: Note that some of these menu options can be disabled for a given database or entry, provided that the corresponding action can't be performed.
sv: Observera att vissa av dessa menyalternativ kan inaktiveras för en angiven databas eller post under förutsättning att den motsvarande åtgärden inte kan utföras.

source: By clicking on the column titles of the list, you'll sort the entries according to the corresponding field.
sv: Genom att klicka på listans kolumntitlar kommer du sortera posterna enligt motsvarande fält.

source: How to open an existing database.
sv: Hur du öppnar en befintlig databas.

source: Opening a database
sv: Öppna en databas

source: To open an existing database, click on the <gui>Open</gui> toolbar button or go in the <gui>File</gui> menu, and select <guiseq> <gui>File</gui><gui>Open</gui></guiseq>.
sv: För att öppna en befintlig databas, klicka på verktygsfältsknappen <gui>Öppna</gui>, eller gå till <gui>Arkiv</gui>-menyn och välj <guiseq> <gui>Arkiv</gui><gui>Öppna</gui></guiseq>.

source: <media type="image" mime="image/png" src="figures/open.png"> Opening a database </media>
sv: <media type="image" mime="image/png" src="figures/open.png"> Öppna en databas </media>

source: A file selection dialog will pop up (see the picture above) and let you select a file. The type of the database can also be selected. Opening an existing database, the type can be guessed if you select <gui>- According to file suffix -</gui>.
sv: En filvalsdialog kommer poppa upp (se bilden ovan) och låta dig välja en fil. Typen av databas kan också väljas. Då en befintlig databas öppnas kan typen gissas om du väljer <gui>— Enligt filändelsen —</gui>.

source: It is also possible to open a file at a remote location (as well as a local file) by typing the URI of the file (e.g. <var>http://my.remote.site/ pyblio.bib</var>) using the <gui>Open Location</gui> dialog, which can be invoked by the <guiseq><gui>File</gui><gui>Open Location</gui></guiseq> menu item.
sv: Det är också möjligt att öppna en fil på en fjärrplats (så väl som en lokal fil) genom att skriva in URI för filen (t.ex. <var>http://my.remote.site/ pyblio.bib</var>) med dialogrutan <gui>Öppna plats</gui> som kan anropas från menyobjektet <guiseq><gui>Arkiv</gui><gui>Öppna plats</gui></guiseq>.

source: Explanations about the graphical interface of <app>Pybliographer</app>.
sv: Förklaringar om det grafiska gränssnittet för <app>Pybliographer</app>.

source: The Graphical Interface
sv: Det grafiska gränssnittet

source: The graphical user interface is called <app>Pybliographic</app>. It provides a simple access to the most common features of the underlying engine, <app>Pybliographer</app> and lets you search, sort and modify bibliographic entries. Moreover, direct insertion of references into <link href="http://www.lyx.org/"><app>Lyx</app></link> and <link href="http://kile.sourceforge.net/"><app>Kile</app></link>, direct queries on Medline, and saving selected references in different formats are also possible.
sv: Det grafiska användargränssnittet kallas <app>Pybliographic</app>. Det tillhandahåller lätt åtkomst till de vanligaste funktionerna i den underliggande motorn <app>Pybliographer</app>, och låter dig söka, sortera och ändra bibliografiposter. Vidare är det även möjligt med direkt insättning av referenser till <link href="http://www.lyx.org/"><app>Lyx</app></link> och <link href="http://kile.sourceforge.net/"><app>Kile</app></link>, direkta frågor till Medline, och att spara valda referenser i olika format.

source: Using Pubmed for your searches.
sv: Använda Pubmed för dina sökningar.

source: Searching in PubMed
sv: Sökning i PubMed

source: With <app>Pybliographic</app>, it is possible to perform a Medline search. To use this option, click on the <guiseq><gui>File</gui><gui>Medline query... </gui></guiseq> menu item. The upcoming window is represented in the picture below.
sv: Med <app>Pybliographic</app> är det möjligt att göra en Medline-sökning. För att använda detta alternativ, klicka på menyobjektet <guiseq><gui>Arkiv</gui><gui>Medline-fråga…</gui></guiseq>. Fönstret som dyker upp visas i bilden nedan.

source: <media type="image" mime="image/png" src="figures/medline.png"> Medline query </media>
sv: <media type="image" mime="image/png" src="figures/medline.png"> Medline-fråga </media>

source: The keyword, you are looking for, should be written into the <em>Search PubMed for</em> field. As it can be seen in the picture above, a number of options (limitations) can be set, which can help to obtain an optimal search result. The matched references, resulted in by the query, appear in the main window as a new database.
sv: Nyckelordet som du letar ska skrivas i fältet <em>Sök i PubMed efter</em>. Som kan ses i bilden ovan kan ett antal alternativ (begränsningar) ställas in, vilket kan hjälpa till att få ett optimalt sökresultat. De matchade referenserna som sökningen resulterar i dyker upp i huvudfönstret som en ny databas.

source: How to find a certain entry in the database.
sv: Hur du hittar en viss post i databasen.

source: Searching
sv: Sökning

source: <app>Pybliographic</app> offers a quite powerful searching mechanism. For searching you can use the quick search entry of the toolbar or the search dialog. To open the search dialog, click on <guiseq><gui>Edit</gui> <gui>Search</gui></guiseq> in the menu. The dialog that appears (see the picture below) displays a search form at the top.
sv: <app>Pybliographic</app> erbjuder en rätt kraftfull sökmekanism. För sökning kan du använda snabbsökrutan i verktygsfältet eller sökdialogen. För att öppna sökdialogen, klicka på <guiseq><gui>Redigera</gui> <gui>Sök</gui></guiseq> i menyn. Dialogrutan som visas (se bilden nedan) visar ett sökformulär högst upp.

source: <media type="image" mime="image/png" src="figures/search.png"> The Search dialog </media>
sv: <media type="image" mime="image/png" src="figures/search.png"> Dialogrutan Sök </media>

source: Simple searches
sv: Enkla sökningar

source: With a simple search, you can select the field that will be searched and you can specify a regular expression to be matched. <gui>- any field -</gui> means that all the existing fields will be searched. This is usually more time-consuming.
sv: Med en enkel sökning kan du välja fältet som kommer sökas och du kan ange ett reguljärt uttryck som ska matchas. <gui>- any field -</gui> betyder att alla befintliga fält kommer att sökas. Detta tar vanligen mera tid.

source: Expert searches
sv: Expertsökningar

source: An expert search is an expression that looks like:
sv: En expertsökning är ett uttryck som ser ut som:

source: has('author','name') | -has('title','test')
sv: has('author','namn') | -has('title','test')

source: Such an expression means: select the entries where the field <em>author</em> matches <em>name</em>, or (symbol <em>|</em>) where the field <em>title</em> does <em>not</em> match <em>test</em>. The boolean <var>and</var> is noted <em>&amp;</em>.
sv: Ett sådant uttryck betyder: välj posterna där fältet <em>author</em> matchar <em>namn</em>, eller (symbolen <em>|</em>) där fältet <em>title</em> <em>inte</em> matchar <em>test</em>. Det booleska <var>och</var> skrivs med <em>&amp;</em>.

source: There are other commands available for this type of search:
sv: Det finns andra kommandon som är tillgängliga för denna typ av sökning:

source: <cmd>has_key(<var>keyname</var>)</cmd> searches on a key name.
sv: <cmd>has_key(<var>nyckelnamn</var>)</cmd> söker ett nyckelnamn.

source: <cmd>has_type(<var>typename</var>)</cmd> searches for entries of a given type name.
sv: <cmd>has_type(<var>typnamn</var>)</cmd> söker poster av ett givet typnamn.

source: <cmd>any_has(<var>value</var>)</cmd> searches for the given value in all the fields of an entry.
sv: <cmd>any_has(<var>värde</var>)</cmd> söker det angivna värdet i alla fält för en post.

source: <cmd>before(<var>field</var>, <var>year</var>, <var>month</var>, <var>day</var>)</cmd> searches for entries where the specified date field is older than the specified date.
sv: <cmd>before(<var>fält</var>, <var>år</var>, <var>månad</var>, <var>dag</var>)</cmd> söker poster där det angivna datumfältet är äldre än det angivna datumet.

source: <cmd>after(<var>field</var>, <var>year</var>, <var>month</var>, <var>day</var>)</cmd> searches for entries where the specified date field is younger than the specified date.
sv: <cmd>after(<var>fält</var>, <var>år</var>, <var>månad</var>, <var>dag</var>)</cmd> söker poster där det angivna datumfältet är yngre än det angivna datumet.

source: Hierarchical searches
sv: Hierarkiska sökningar

source: After a search, only the selected items are displayed in the main window. It makes it convenient to select a specific author, and then browse its publications for example.
sv: Efter en sökning visas endast de valda objekten i huvudfönstret. Det gör det praktiskt att välja en specifik författare och sedan exempelvis bläddra igenom författarens publikationer.

source: In addition, the results of all the searches are kept in the tree located below the search form. Therefore, a new search can be a refinement of a previous one. If you select the tree item corresponding for example to all the articles written by a certain Nostradamus, you'll be able to select only those whose title contains the word eclipse.
sv: Dessutom behålls resultaten för alla sökningarna i trädet under sökformuläret. En ny sökning kan därför vara en förfining av en tidigare sökning. Om du väljer trädobjektet som exempelvis motsvarar alla artiklar som skrivits av en viss Nostradamus, så kommer du ha möjligheten att endast välja de vars titel innehåller ordet eclipse.

source: Right-clicking in this tree pops up a contextual menu that allows you to remove unuseful searches.
sv: Att högerklicka i detta träd poppar upp en snabbvalsmeny som låter dig ta bort ohjälpsamma sökningar.

source: To select the full list of database entries again, just click on the <gui>Full database</gui> item at the top of the search tree, or push the 'Esc' button on the keyboard when you are in the main window.
sv: För att välja den fullständiga listan över databasposter igen, klicka bara på objektet <gui>Hela databasen</gui> högst upp i sökträdet, eller klicka på ”Esc” på tangentbordet då du är i huvudfönstret.

source: How to change settings and preferences.
sv: Hur du ändrar inställningar.

source: Configuration
sv: Konfiguration

source: Under the <guiseq><gui>Settings</gui></guiseq> menu, you can find some options to customize <app>Pybliographer</app>.
sv: Under menyn <guiseq><gui>Inställningar</gui></guiseq> kan du hitta några alternativ för att anpassa <app>Pybliographer</app>.

source: Entry types and field names configuration
sv: Konfiguration av inmatningstyper och fältnamn

source: <media type="image" mime="image/png" src="figures/fields.png"> Configuration of fields and entry types </media>
sv: <media type="image" mime="image/png" src="figures/fields.png"> Konfiguration av fält och inmatningstyper </media>

source: Selecting the <guiseq><gui>Settings</gui><gui>Fields</gui> </guiseq> menu item, it is possible to add or remove fields, to set their type, and to define which fields should be associated with a given type of entry. In addition, the mandatory and optional fields are also can be varied. In the window displayed above, as an example, the association of the <em>Article</em> entry type can be seen.
sv: Genom att välja menyobjektet <guiseq><gui>Inställningar</gui><gui>Fält</gui> </guiseq> är det möjligt att lägga till eller ta bort fält, att ställa in deras typ, och att definiera vilka fält som ska associeras med en given inmatningstyp. De obligatoriska och valfria fälten kan också varieras. I fönstret som visas ovan kan exempelvis associationen för inmatningstypen <em>Artikel</em> ses.

source: Preferences
sv: Inställningar

source: Clicking on the <guiseq><gui>Settings</gui><gui>Preferences</gui> </guiseq> menu item, a lot of configuration options can be controlled. Such options are, for instance, settings of the different type of bibliographic database formats, autosave, size of history, default editing mode, the default type of a newly created entry, and resource configuration.
sv: Många konfigurationsalternativ kan styras genom att klicka på menyobjektet <guiseq><gui>Inställningar</gui><gui>Inställningar</gui> </guiseq>. Sådana alternativ är exempelvis inställningar för de olika typerna av format för bibliografidatabaser, automatisk sparning, storlek på historik, standardredigeringsläge, standardtypen för en nyskapad post samt resurskonfiguration.

source: Customize the sort order of the entries.
sv: Anpassa sorteringsordningen för posterna.

source: Sorting
sv: Sortering

source: Clicking on the title of each column in the main index provides some rudimentary way of sorting a database. A much powerful method is to open the sort dialog (in <guiseq> <gui>Edit</gui><gui>Sort</gui></guiseq>). This menu, displayed in the picture below, gives a list of fields which can be used as sort criteria, plus a flag indicating how they are currently used. By clicking twice on the item, it is possible to choose how the field will be used:
sv: Att klicka på titeln för varje kolumn i huvudindexet tillhandahåller ett trivialt sätt att sortera en databas. En mycket mer kraftfull metod är att öppna sorteringsdialogen (i <guiseq> <gui>Redigera</gui><gui>Sortera</gui></guiseq>). Denna meny, som visas i bilden nedan, ger en lista över fält som kan användas som sorteringskriterier, plus en flagga som indikerar hur de för närvarande används. Genom att klicka två gånger på objektet är det möjligt att välja hur fältet ska användas:

source: Nothing means the field is not in use.
sv: Ingenting betyder att fältet inte används.

source: A <em>triangle</em>-like symbol means sort in <em>ascending order</em>.
sv: En <em>triangel</em>-liknande symbol betyder sortering i <em>stigande ordning</em>.

source: An <em>upside down triangle</em>-like symbol means sort in <em>descending order</em>.
sv: En <em>upp och nervänd triangel</em>-liknande symbol betyder sortering i <em>sjunkande ordning</em>.

source: The order in which the sorting is performed depends on the order in the list. To modify this order, simply drag and drop an item to change its position. To make this sort order default, it can be saved by clicking on the <gui>Set as default</gui> button.
sv: Ordningen i vilken sorteringen utförs beror på ordningen på listan. För att ändra denna ordning kan du helt enkelt dra och släppa ett objekt för att ändra dess position. För att göra denna sorteringsordning till standard kan den sparas genom att klicka på knappen <gui>Ställ in som standard</gui>.

source: <media type="image" mime="image/png" src="figures/sort.png"> The Sort dialog </media>
sv: <media type="image" mime="image/png" src="figures/sort.png"> Sorteringsdialogen </media>

source: Creating your own styles for <app>Pybliographer</app>.
sv: Skapa dina egna stilar för <app>Pybliographer</app>.

source: New Styles
sv: Nya stilar

source: It is possible to describe your own bibliography style, by writing a simple XML file. The XML file should have the following header:
sv: Det är möjligt att beskriva din egen bibliografistil genom att skriva en enkel XML-fil. XML-filen ska ha följande filhuvud:

source: The whole description should fit in a &lt;bibstyle&gt; pair of tags, whose content is shortly described in this section. It is suggested that the interested users look at the corresponding DTD, which describes the allowed syntax in details. This DTD can be found in the same directory as the default style files.
sv: Hela beskrivningen ska passa i ett par &lt;bibstyle&gt;-taggar, vars innehåll kort beskrivs i detta avsnitt. Intresserade användare föreslås ta sig en titt på motsvarande DTD, som detaljerat beskriver den tillåtna syntaxen. Denna DTD kan hittas i samma katalog som standardstilfilerna.

source: Global formatting
sv: Global formatering

source: The XML style file describes how the different data fields are organized in order to create a bibliographic style. For example, it can specify that an article starts with the article title in bold, followed by the authors names, etc.
sv: XML-stilfilen beskriver hur de olika datafälten organiseras för att skapa en bibliografistil. Till exempel kan den ange att en artikel startar med artikelns titel i fetstil, följd av författarnas namn o.s.v.

source: In its current incarnation, the XML format can however not describe lower-level informations, like how an author's name should be output. This is done by pointing to a set of python functions, grouped in a module. Let's consider the following example:
sv: I sin nuvarande inkarnation kan XML-formatet dock inte beskriva information på lägre nivå, så som hur en författares namn ska matas ut. Detta görs genom att peka på en uppsättning pythonfunktioner som är grupperade i en modul. Låt oss betänka följande exempel:

source: In this example, we require that the <em>author</em> fields should be formatted by the <code>full_authors()</code> function, located in the <file>generic</file> module.
sv: I detta exempel kräver vi att <em>author</em>-fälten ska formateras av funktionen <code>full_authors()</code> som finns i modulen <file>generic</file>.

source: Such a module has to be declared in the <file>pybrc.py</file> file, by a line like:
sv: En sådan modul måste deklareras i filen <file>pybrc.py</file> av en rad som:

source: The precise definition of the formatting functions is better explained by looking at the code of <file>Generic.py</file> for example.
sv: Den precisa definitionen av formateringsfunktionerna förklaras bättre genom att titta på koden för exempelvis <file>Generic.py</file>.

source: Bibliography definition
sv: Bibliografidefinition

source: Once the basic formatting definitions have been specified, it is possible to describe the aspect of the actual bibliographies with following tags:
sv: Då de grundläggande formateringsdefinitionerna har angivits är det möjligt att beskriva aspekten av de faktiska bibliografierna med följande taggar:

source: &lt;style name="<var>stylename</var>"&gt;
sv: &lt;style name="<var>stilnamn</var>"&gt;

source: This tag specifies the current display style, among <em>bold, italic, slanted, emph</em>.
sv: Denna tagg anger den aktuella visningsstilen, bland <em>bold, italic, slanted, emph</em>.

source: &lt;inentry name="<var>entryname</var>"&gt;
sv: &lt;inentry name="<var>postnamn</var>"&gt;

source: This tag encloses a block that is only to appear in entries of type <var>entryname</var>.
sv: Denna tagg innefattar ett block som bara ska dyka upp i poster av typ <var>fältnamn</var>.

source: &lt;notinentry name="<var>entryname</var>"&gt;
sv: &lt;notinentry name="<var>postnamn</var>"&gt;

source: This tag encloses a block that is only to appear in entries that are <em>not</em> of type <var>entryname</var>.
sv: Denna tagg innefattar ett block som bara ska dyka upp i poster som <em>inte</em> är av typ <var>fältnamn</var>.

source: &lt;infield name="<var>fieldname</var>"&gt;
sv: &lt;infield name="<var>fältnamn</var>"&gt;

source: This tag encloses a block that only appears when the specified <var>fieldname</var> field exists in the current entry.
sv: Denna tagg innefattar ett block som bara dyker upp då det angivna fältet <var>fältnamn</var> finns i aktuell post.

source: &lt;notinfield name="<var>fieldname</var>"&gt;
sv: &lt;notinfield name="<var>fältnamn</var>"&gt;

source: This tag encloses a block that only appears when the specified <var>fieldname</var> field <em>does not</em> exist in the current entry.
sv: Denna tagg innefattar ett block som bara dyker upp då det angivna fältet <var>fältnamn</var> <em>inte</em> finns i aktuell post.

source: &lt;content <var>name=</var>"<var>fieldname</var>"/&gt;
sv: &lt;content <var>name=</var>"<var>fältnamn</var>"/&gt;

source: This empty tag is replaced by the content of the current field (when placed in a &lt;infield&gt; block) or the content of the field specified as attribute.
sv: Denna tomma tagg ersätts av innehållet i det aktuella fältet (då den placeras i ett &lt;infield&gt;-block) eller innehållet för fältet specificerat som attribut.
